## Import pandas

In [49]:
import pandas as pd

## Create DataFrame

In [50]:
mydict = {
    "dev_id": ["001", "002", "003", "004", "005"],
    "name": ["John Hunter", "Lothar Müller", "Andrew Holland", "John Doe", "Elon Brown"],
    "age": [36, 48, 21, 44, 18],
    "salary": [60000, 90000, 50000, 120000, 90000],
    "country": ["Germany", "Germany", "United States", "Scotland", "United States"],
    "city": ["Berlin", "Munich", "Boston", "Edinburgh", "New York"],
}

df_dev = pd.DataFrame(mydict)
df_dev.set_index("dev_id", inplace=True)
df_dev

                  name  age  salary        country       city
dev_id
001        John Hunter   36   60000        Germany     Berlin
002      Lothar Müller   48   90000        Germany     Munich
003     Andrew Holland   21   50000  United States     Boston
004           John Doe   44  120000       Scotland  Edinburgh
005         Elon Brown   18   90000  United States   New York

## Get Datatypes

In [51]:
df_dev.dtypes

name       object
age         int64
salary      int64
country    object
city       object
dtype: object

## Split column "name"

In [52]:
df_new = df_dev["name"].str.split(" ", n=1, expand=True)
df_dev.insert(0, "first_name", df_new[0])
df_dev.insert(1, "last_name", df_new[1])
df_dev.drop(columns =["name"], inplace=True)
df_dev

       first_name last_name  age  salary        country       city
dev_id
001          John    Hunter   36   60000        Germany     Berlin
002        Lothar    Müller   48   90000        Germany     Munich
003        Andrew   Holland   21   50000  United States     Boston
004          John       Doe   44  120000       Scotland  Edinburgh
005          Elon     Brown   18   90000  United States   New York

## Transform column "age"

In [53]:
df_dev['age'] = df_dev['age'].astype(str)
df_dev

       first_name last_name age  salary        country       city
dev_id
001          John    Hunter  36   60000        Germany     Berlin
002        Lothar    Müller  48   90000        Germany     Munich
003        Andrew   Holland  21   50000  United States     Boston
004          John       Doe  44  120000       Scotland  Edinburgh
005          Elon     Brown  18   90000  United States   New York

## Transform column "salary"

In [54]:
df_dev['salary'] = df_dev['salary'].astype(float)
df_dev

       first_name last_name age    salary        country       city
dev_id
001          John    Hunter  36   60000.0        Germany     Berlin
002        Lothar    Müller  48   90000.0        Germany     Munich
003        Andrew   Holland  21   50000.0  United States     Boston
004          John       Doe  44  120000.0       Scotland  Edinburgh
005          Elon     Brown  18   90000.0  United States   New York

## Transform column "country"

In [55]:
df_dev['country'] = df_dev['country'].str.upper()
df_dev

       first_name last_name age    salary        country       city
dev_id
001          John    Hunter  36   60000.0        GERMANY     Berlin
002        Lothar    Müller  48   90000.0        GERMANY     Munich
003        Andrew   Holland  21   50000.0  UNITED STATES     Boston
004          John       Doe  44  120000.0       SCOTLAND  Edinburgh
005          Elon     Brown  18   90000.0  UNITED STATES   New York

## Get Datatypes

In [56]:
df_dev.dtypes

first_name     object
last_name      object
age            object
salary        float64
country        object
city           object
dtype: object